Revit 2026 API

# ISaveSharedCoordinatesCallback Interface

---

An interface that may be used to control Revit when trying to unload or reload a Revit link with changes in shared coordinates.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface ISaveSharedCoordinatesCallback
```
```vb
Public Interface ISaveSharedCoordinatesCallback
```
```cpp
public interface class ISaveSharedCoordinatesCallback
```
```fsharp
type ISaveSharedCoordinatesCallback = interface end
```

The ISaveSharedCoordinatesCallback type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetSaveModifiedLinksOption | Determines whether Revit should save the link, not save the link, or discard shared positioning entirely. |

#### Reference

Autodesk.Revit.DB Namespace